var sound1
function preload(){
  sound1 = loadSound("mixaund-dreamers.mp3") //先把音樂檔載入到sound1程式碼中
}

function setup() {
  createCanvas(windowWidth, windowHeight);  //以視窗長寬
  background("#fbf8cc");  //背景為"淡黃色"
  analyzer = new p5.Amplitude();
  analyzer.setInput(sound1)
}



function draw() {
  //background(220);
  stroke("#333533")  //線條顏色為"深灰色""
  strokeWeight(3)  //線條粗細
  fill("#ffddd2")  //充滿"粉色"
  //rectMode(CENTER)  //設定方框中心點為座標點

  //++++大圓第一排+++++
  ellipse(1*50,50,50)  //畫一個圓
  ellipse(3*50,50,50)  //畫一個圓
  ellipse(5*50,50,50)   //畫一個圓
  ellipse(7*50,50,50)   //畫一個圓
  ellipse(9*50,50,50)   //畫一個圓
  ellipse(11*50,50,50)   //畫一個圓
  ellipse(13*50,50,50)   //畫一個圓
  ellipse(15*50,50,50)   //畫一個圓
  //++++大圓第二排+++++
  ellipse(1*50,3*50,50)  //畫一個圓


  //++++++四邊的圓第一排++++++
  stroke("#16425b")  //線條顏色為"深藍色"
  strokeWeight(2)  //線條粗細
  noFill()  //不充滿顏色
  ellipse(3*25,1*25,20)  //在右上角畫一個小圓
  ellipse(3*25,3*25,20)  //在右下角畫一個小圓
  ellipse(1*25,1*25,20)  //在左上角畫一個小圓
  ellipse(1*25,3*25,20)  //在左下角畫一個小圓
  
  ellipse(7*25,1*25,20)  //在右上角畫一個小圓
  ellipse(7*25,3*25,20)  //在右下角畫一個小圓
  ellipse(5*25,1*25,20)  //在左上角畫一個小圓
  ellipse(5*25,3*25,20)  //在左下角畫一個小圓
  
  ellipse(11*25,1*25,20)  //在右上角畫一個小圓
  ellipse(11*25,3*25,20)  //在右下角畫一個小圓
  ellipse(9*25,1*25,20)  //在左下角畫一個小圓
  ellipse(9*25,3*25,20)  //在左上角畫一個小圓

  ellipse(15*25,1*25,20)  //在右上角畫一個小圓
  ellipse(15*25,3*25,20)  //在右下角畫一個小圓
  ellipse(13*25,1*25,20)  //在左下角畫一個小圓
  ellipse(13*25,3*25,20)  //在左上角畫一個小圓

  ellipse(19*25,1*25,20)  //在右上角畫一個小圓
  ellipse(19*25,3*25,20)  //在右下角畫一個小圓
  ellipse(17*25,1*25,20)  //在左下角畫一個小圓
  ellipse(17*25,3*25,20)  //在左上角畫一個小圓

  ellipse(23*25,1*25,20)  //在右上角畫一個小圓
  ellipse(23*25,3*25,20)  //在右下角畫一個小圓
  ellipse(21*25,1*25,20)  //在左下角畫一個小圓
  ellipse(21*25,3*25,20)  //在左上角畫一個小圓

  ellipse(27*25,1*25,20)  //在右上角畫一個小圓
  ellipse(27*25,3*25,20)  //在右下角畫一個小圓
  ellipse(25*25,1*25,20)  //在左下角畫一個小圓
  ellipse(25*25,3*25,20)  //在左上角畫一個小圓

  ellipse(31*25,1*25,20)  //在右上角畫一個小圓
  ellipse(31*25,3*25,20)  //在右下角畫一個小圓
  ellipse(29*25,1*25,20)  //在左下角畫一個小圓
  ellipse(29*25,3*25,20)  //在左上角畫一個小圓

  //++++++四邊的圓第二排++++++
  ellipse(3*25,7*25,20)  //在右上角畫一個小圓
  ellipse(3*25,5*25,20)  //在右下角畫一個小圓
  ellipse(1*25,7*25,20)  //在左上角畫一個小圓
  ellipse(1*25,5*25,20)  //在左下角畫一個小圓



  noStroke()
  fill("#4a7c59")  //充滿"深綠色"
  //++++++樹枝第一排++++++
  ellipse(1*50,85,5,25) //樹枝
  ellipse(3*50,85,5,25) //樹枝
  ellipse(5*50,85,5,25) //樹枝
  ellipse(7*50,85,5,25) //樹枝
  ellipse(9*50,85,5,25) //樹枝
  ellipse(11*50,85,5,25) //樹枝
  ellipse(13*50,85,5,25) //樹枝
  ellipse(15*50,85,5,25) //樹枝

  //++++++樹枝第二排++++++
  ellipse(1*50,185,5,25) //樹枝

  //noFill()  //不充滿顏色
  fill("#432818")  //充滿"咖啡色"
  //++++++方框第一排++++++
  rect(1*40,90,20)  //畫一個方框
  rect(3.5*40,90,20)  //畫一個方框
  rect(6*40,90,20)  //畫一個方框
  rect(8.5*40,90,20)  //畫一個方框
  rect(11*40,90,20)  //畫一個方框
  rect(13.5*40,90,20)  //畫一個方框
  rect(16*40,90,20)  //畫一個方框
  rect(18.5*40,90,20)  //畫一個方框

  //++++++方框第二排++++++
  rect(1*40,190,20)  //畫一個方框
}

//按下滑鼠播放音樂
function mousePressed(){
  if(sound1.isPlaying()){
    sound1.stop();
  }else{
    sound1.play();
  }
}